Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Adds a bezier spline to the current figure of a path
fr: Ajoute une spline de Bézier à la figure courante d'un tracé

source: Search GdipAddPathBezier in MSDN Library
fr: Consultez GdipAddPathBezier dans la Librairie MSDN.

source: Adds a closed cardinal spline to a path
fr: Ajoute une spline cardinale fermée à un tracé

source: Array of points that define the cardinal spline:
fr: Tableau de points qui définit la spline cardinale:

source: A cardinal spline is a curve that passes through each point in the array.
fr: Une spline cardinale est une courbe qui passe par chaque point du tableau.

source: Search GdipAddPathClosedCurve in MSDN Library
fr: Consultez GdipAddPathClosedCurve dans la Librairie MSDN.

source: Nonnegative real number that controls the length of the curve and how the curve bends.
fr: Nombre décimal positif ou nul qui contrôle la longueur et la courbure de la courbe.

source: A value of 0 specifies that the spline is a sequence of straight lines.
fr: Une valeur de 0 indique que la spline est une séquence de lignes droites.

source: As the value increases, the curve becomes fuller.
fr: Plus la valeur augmente, plus la courbure augmente.

source: Search GdipAddPathClosedCurve2 in MSDN Library
fr: Consultez GdipAddPathClosedCurve2 dans la Librairie MSDN.

source: Adds a cardinal spline to the current figure of a path
fr: Ajoute une spline cardinale à la figure en cours

source: Search GdipAddPathCurve in MSDN Library
fr: Consultez GdipAddPathCurve dans la Librairie MSDN.

source: The index of the array element that is used as the first point of the cardinal spline, this is the index of the specific point in the array minus 1
fr: Index de l'élément du tableau $aPoints qui est utilisé comme premier point de la spline cardinale, c'est l'index du point spécifique dans le tableau moins 1

source: Number of segments in the cardinal spline.
fr: Nombre de segments dans la spline cardinale.

source: Segments are the curves that connect consecutive points in the array
fr: Les segments relient les points consécutifs du tableau

source: The cardinal spline is a curve that passes through a subset (specified by the $iOffset and $iNumOfSegments parameters) of the points in the array
fr: La spline cardinale est une courbe qui passe par un sous-ensemble (spécifié par les paramètres $iOffset et $iNumOfSegments) des points du tableau

source: Search GdipAddPathCurve3 in MSDN Library
fr: Consultez GdipAddPathCurve3 dans la Librairie MSDN.

source: Adds an ellipse to the current figure a path
fr: Ajoute une ellipse à la figure actuelle

source: Search GdipAddPathEllipse in MSDN Library
fr: Consultez GdipAddPathEllipse dans la Librairie MSDN.

source: original ellipse
fr: ellipse originale

source: flattened ellipse
fr: Ellipse aplatie

source: Adds a line to the current figure of a path
fr: Ajoute une ligne à la figure actuelle

source: Search GdipAddPathLine in MSDN Library
fr: Consultez GdipAddPathLine dans la Librairie MSDN.

source: Create a copy of the path
fr: Créez une copie de la figure

source: Outline
fr: Aperçu

source: Adds a sequence of lines to the current figure of a path
fr: Ajoute une séquence de lignes à la figure actuelle

source: Array of points that define the lines:
fr: Tableau de points qui définit les lignes :

source: Search GdipAddPathLine2 in MSDN Library
fr: Consultez GdipAddPathLine2 dans la Librairie MSDN.

source: Adds a path to another path
fr: Ajoute une figure à la figure actuelle

source: Pointer to a GraphicsPath object to be added to $hPath1
fr: Handle de l'objet GraphicsPath à ajouter à $hPath1

source: Specifies whether the first figure in the added path is part of the last figure in this path:
fr: Valeur booléenne qui indique si la première figure du tracé ajouté appartient à la dernière figure du tracé actuel:

source: True - The first figure in the added $hPath2 is part of the last figure in the $hPath1 path
fr: True - La première figure du tracé ajouté $hPath2 fait partie de la dernière figure du tracé $hPath1

source: False - The first figure in the added $hPath2 is separated from the last figure in the $hPath1 path
fr: False - La première figure du tracé ajouté $hPath2 est séparée de la dernière figure du tracé $hPath1

source: Even if the value of the $bConnect parameter is True, this function might not be able to make the first figure of the added $hPath2 path part of the last figure of the $hPath1 path.
fr: Même si la valeur du paramètre $bCONNECT est True, cette fonction pourrait ne pas être en mesure de faire la première figure de $hPath2 partie de trajet supplémentaire de la dernière figure du tracé $hPath1.

source: If either of those figures is closed, then they must remain separated figures.
fr: Si l'une de ces figures est fermée, alors elles doivent rester des figures séparées.

source: Search GdipAddPathPath in MSDN Library
fr: Consultez GdipAddPathPath dans la Librairie MSDN.

source: Draw path1 to graphics handle (GUI)
fr: Dessine $hPath1 avec le handle Graphic (GUI)

source: add path2 to path1
fr: Ajoute $hPath2 à $hPath1

source: move path2 to an offset of 300
fr: Décale $hPath2 de 300

source: Draw path2 to graphics handle (GUI)
fr: Dessine $Path2 avec le handle Graphic (GUI)

source: move path1+Path2 to an offset of 600
fr: Décale $hPath1 + $hPath2 de 600

source: Adds a pie to a path
fr: Ajoute un secteur angulaire à une figure

source: The X coordinate of the upper left corner of the rectangle that bounds the ellipse that bounds the pie
fr: La coordonnée X du coin supérieur gauche du rectangle qui délimite l'ellipse qui inclut le secteur angulaire

source: The Y coordinate of the upper left corner of the rectangle that bounds the ellipse that bounds the pie
fr: La coordonnée Y du coin supérieur gauche du rectangle qui délimite l'ellipse qui inclut le secteur angulaire

source: The width of the rectangle that bounds the ellipse that bounds the pie
fr: La largeur du rectangle qui délimite l'ellipse qui inclut le secteur angulaire

source: The height of the rectangle that bounds the ellipse that bounds the pie
fr: La hauteur du rectangle qui délimite l'ellipse qui inclut le secteur angulaire

source: Search GdipAddPathPie in MSDN Library
fr: Consultez GdipAddPathPie dans la Librairie MSDN.

source: Adds a polygon to a path
fr: Ajoute un polygone la figure

source: Array of points that define the vertices of the polygon:
fr: Tableau de points qui définit les sommets du polygone:

source: Search GdipAddPathPolygon in MSDN Library
fr: Consultez GdipAddPathPolygon dans la Librairie MSDN.

source: Adds a rectangle to a path
fr: Ajoute un rectangle à une figure

source: Search GdipAddPathRectangle in MSDN Library
fr: Consultez GdipAddPathRectangle dans la Librairie MSDN.

source: Adds the outline of a string to a path
fr: Ajoute le contour d'une chaîne à une figure

source: Pointer to a FontFamily object that specifies the font family for the string
fr: Handle de l'objet FontFamily qui spécifie la famille de la police pour la chaîne

source: The em size, in world units, of the string characters
fr: La taille 'em', en unité universelle, des caractères de la chaîne

source: Pointer to a StringFormat object that specifies layout information for the string
fr: Handle de l'objet StringFormat qui spécifie des informations de mise en page pour la chaîne

source: Search GdipAddPathString in MSDN Library
fr: Consultez GdipAddPathString dans la Librairie MSDN.

source: Creates a PathGradientBrush object based on a GraphicsPath object
fr: Crée un objet PathGradientBrush à partir d'un objet GraphicsPath

source: Pointer to a GraphicsPath object that specifies the boundary path of the path gradient brush
fr: Handle de l'objet GraphicsPath qui spécifie le tracé limite du pinceau à dégradé de tracé

source: a pointer to a new PathGradientBrush object.
fr: Retourne le handle du nouvel objet PathGradientBrush.

source: Search GdipCreatePathGradientFromPath in MSDN Library
fr: Consultez GdipCreatePathGradientFromPath dans la Librairie MSDN.

source: Gets the center point of a path gradient brush
fr: Obtient le point central d'un pinceau à couleurs dégradées de tracé

source: Pointer to a PathGradientBrush object
fr: Handle de l'objet PathGradientBrush

source: an array containing the point coordinates:
fr: Retourne un tableau contenant les coordonnées du point:

source: [0] - Center point X coordinate
fr: [0] - Point central, coordonnée X

source: [1] - Center point Y coordinate
fr: [1] - Point central, coordonnée Y

source: Search GdipGetPathGradientCenterPoint in MSDN Library
fr: Consultez GdipGetPathGradientCenterPoint dans la Librairie MSDN.

source: Gets the focus scales of a path gradient brush
fr: Pour un pinceau à couleurs dégradées de tracé, obtient les facteurs d'échelles pour l'atténuation du dégradé à partir du point focus

source: an array containing the focus scales:
fr: Retourne un tableau contenant les échelles du point de focus:

source: [0] - X focus scale
fr: [0] - échelle du focus suivant X

source: [1] - Y focus scale
fr: [1] - échelle de focus suivant Y

source: Search GdipGetPathGradientFocusScales in MSDN Library
fr: Consultez GdipGetPathGradientFocusScales dans la Librairie MSDN.

source: Gets the number of points in the array of points that defines a brush's boundary path
fr: Obtient le nombre de points dans le tableau de points qui définit la frontière du tracé du pinceau

source: the number of point in the array of points that defines the brush's boundary path.
fr: Retourne le nombre de points dans le tableau de points qui définit la frontière du pinceau.

source: Search GdipGetPathGradientPointCount in MSDN Library
fr: Consultez GdipGetPathGradientPointCount dans la Librairie MSDN.

source: Gets the smallest rectangle that encloses the boundary path of a path gradient brush
fr: Obtient le plus petit rectangle qui entoure la frontière du tracé d'un pinceau à couleurs dégradées de tracé

source: Search GdipGetPathGradientRect in MSDN Library
fr: Consultez GdipGetPathGradientRect dans la Librairie MSDN.

source: Pointer to a matrix to be multiplied by the brush's current transformation matrix
fr: Handle de la matrice qui sera multiplié par la matrice de transformation actuelle du pinceau

source: Search GdipMultiplyPathGradientTransform in MSDN Library
fr: Consultez GdipMultiplyPathGradientTransform dans la Librairie MSDN.

source: Resets the transformation matrix of a path gradient brush to the identity matrix
fr: Réinitialise la matrice de transformation d'un pinceau à couleurs dégradées de tracé avec la matrice identité

source: Search GdipResetPathGradientTransform in MSDN Library
fr: Consultez GdipResetPathGradientTransform dans la Librairie MSDN.

source: Sets the color of the center point of a path gradient brush
fr: Définit la couleur du point central d'un pinceau à couleurs dégradées de tracé

source: Alpha, Red, Green and Blue components of the new center color
fr: Alpha, Rouge, Vert et Bleu composants de la nouvelle couleur de centre

source: Search GdipSetPathGradientCenterColor in MSDN Library
fr: Consultez GdipSetPathGradientCenterColor dans la Librairie MSDN.

source: Sets the center point of a path gradient brush
fr: Définit le point central d'un pinceau à couleurs dégradées de tracé

source: X coordinate of the new center point
fr: Coordonnée X du nouveau point central

source: Y coordinate of the new center point
fr: Coordonnée Y du nouveau point central

source: Search GdipSetPathGradientCenterPoint in MSDN Library
fr: Consultez GdipSetPathGradientCenterPoint dans la Librairie MSDN.

source: Sets the focus scales of a path gradient brush
fr: Définit les facteurs d'échelles pour l'atténuation du dégradé à partir du point focus (central)

source: Real number that specifies the X focus scale
fr: Nombre décimal qui définit l'échelle suivant X du focus

source: Real number that specifies the Y focus scale
fr: Nombre décimal qui définit l'échelle suivant Y du focus

source: Search GdipSetPathGradientFocusScales in MSDN Library
fr: Consultez GdipSetPathGradientFocusScales dans la Librairie MSDN.

source: Specifies whether gamma correction is enabled for a path gradient brush
fr: Définit si la correction gamma est activée pour un pinceau à couleurs dégradées de tracé

source: If True, gamma correction is enabled; otherwise, gamma correction is disabled
fr: Si vrai, la correction gamma est activée; sinon, la correction gamma est désactivée

source: Search GdipSetPathGradientGammaCorrection in MSDN Library
fr: Consultez GdipSetPathGradientGammaCorrection dans la Librairie MSDN.

source: Sets the blend shape of a path gradient brush to create a custom blend based on a triangular shape
fr: Définit la manière de mélanger les couleurs d'un pinceau à couleurs dégradées de tracé pour créer un mélange personnalisé selon sur une courbe en triangle

source: Number in the range 0.0 to 1.0 that specifies where the center color will be at its highest intensity
fr: Nombre dans la gamme de 0,0 à 1,0 qui spécifie où la couleur de centre sera à sa plus haute intensité

source: Number in the range 0.0 to 1.0 that specifies the maximum intensity of center color that gets blended with the boundary color
fr: Nombre compris entre 0.0 à 1.0 qui indique le pourcentage (/100) de la couleur de fin que le dégradé atteindra progressivement par fusion avec la couleur de début du dégradé.La valeur par défaut est 1, ce qui signifie que la couleur de fin de zone est en pleine intensité

source: Search GdipSetPathGradientLinearBlend in MSDN Library
fr: Consultez GdipSetPathGradientLinearBlend dans la Librairie MSDN.

source: Sets the preset colors and the blend positions of a path gradient brush
fr: Définit les couleurs à mélanger et les positions correspondantes d'un pinceau à couleurs dégradées de tracé

source: [0][0] - Number of preset colors and blend positions
fr: [0][0] - Le nombre de paires (couleur,position), doit être d'au moins 2

source: Search GdipSetPathGradientPresetBlend in MSDN Library
fr: Consultez GdipSetPathGradientPresetBlend dans la Librairie MSDN.

source: red
fr: rouge

source: position = boundary
fr: position = frontière

source: green
fr: vert

source: 70% of distance boundary->center point
fr: 70% de la distance frontière-> point central

source: blue
fr: bleu

source: center point
fr: point central

source: Sets the blend shape of a path gradient brush to create a custom blend based on a bell-shaped curve
fr: Définit la manière de mélanger les couleurs d'un pinceau à couleurs dégradées de tracé pour créer un mélange personnalisé selon une courbe en forme de cloche

source: Search GdipSetPathGradientSigmaBlend in MSDN Library
fr: Consultez GdipSetPathGradientSigmaBlend dans la Librairie MSDN.

source: Sets the surround color for a path gradient brush
fr: Définit la couleur d'ambiance pour un pinceau à couleurs dégradées de tracé

source: Alpha, Red, Green and Blue components of the new surrounding colors
fr: Composantes Alpha, Rouge, Vert et Bleu de la nouvelle couleur d'ambiance

source: Search GdipSetPathGradientSurroundColorsWithCount in MSDN Library
fr: Consultez GdipSetPathGradientSurroundColorsWithCount dans la Librairie MSDN.

source: Sets the surround colors currently specified for a path gradient brush
fr: Définit les couleurs "surround" d'un objet PathGradientBrush

source: Array containing the surrounding colors:
fr: Tableau contenant les couleurs "surround":

source: [0] - Number of colors
fr: [0] - Nombre de couleurs

source: [1] - Color 1
fr: [1] - Couleur 1

source: [2] - Color 2
fr: [2] - Couleur 2

source: [n] - Color n
fr: [n] - Couleur n

source: the number of surround colors set.
fr: Retourne le nombre de couleurs "surround" définies.

source: The surround colors are colors specified for discrete points on the brush's boundary path.
fr: Les couleurs "surround" sont les couleurs des points discrets de la frontière du tracé.

source: Sets the transformation matrix of a path gradient brush
fr: Définit la matrice de transformation d'un objet PathGradientBrush

source: Search GdipSetPathGradientTransform in MSDN Library
fr: Consultez GdipSetPathGradientTransform dans la Librairie MSDN.

source: Sets the wrap mode of a path gradient brush
fr: Définit le mode d'habillage d'un objet PathGradientBrush

source: Wrap mode that specifies how an area is tiled when it is painted with a brush:
fr: Le mode Wrap spécifie comment une zone est pavée quand elle est peinte:

source: Search GdipSetPathGradientWrapMode in MSDN Library
fr: Consultez GdipSetPathGradientWrapMode dans la Librairie MSDN.

source: Clones a path
fr: Clone un objet GraphicsPath

source: Pointer to a GraphicsPath object to be cloned
fr: Handle de l'objet GraphicsPath à cloner

source: a pointer to a new cloned GraphicsPath object.
fr: Retourne le handle du nouvel objet GraphicsPath cloné.

source: After you are done with the object, call _GDIPlus_PathDispose() to release the object resources.
fr: Lorsque vous en avez terminé avec l'objet, appelez _GDIPlus_PathDispose() pour libérer les ressources de l'objet.

source: Search GdipClonePath in MSDN Library
fr: Consultez GdipClonePath dans la Librairie MSDN.

source: spiral as a sequence of lines
fr: Spirale comme une séquence de lignes

source: reverse path => end point of path = start point of cloned path
fr: Inverse path => point de fin du path = point de départ du path cloné

source: zoom cloned path
fr: Agrandit path cloné

source: add scaled/reversed path to original path
fr: Ajoute la path mis à l'échelle et inversé au path original

source: reset matrix
fr: Réinitialise la matrice

source: move path to center of window
fr: Déplace le path au centre de la fenêtre

source: Closes the current figure of a path
fr: Ferme la figure en cours d'un objet GraphicsPath

source: Search GdipClosePathFigure in MSDN Library
fr: Consultez GdipClosePathFigure dans la Librairie MSDN.

source: Creates a GraphicsPath object based on an array of points, an array of types, and a fill mode
fr: Crée un objet GraphicsPath à partir d'un tableau de points, d'un tableau de types, et d'un mode de remplissage

source: Array of points and types that specifies the endpoints and control points of the lines and bezier splines that are used to draw the path and the points types:
fr: Tableau de points et de types qui spécifie les points de terminaison et les points de contrôle des lignes et des splines de Bézier qui sont utilisés pour dessiner le tracé et les types points :

source: [0][0] - Number of points and types
fr: [0][0] - Nombre de points et types

source: [1][2] - Point 1 type
fr: [1][2] - Point 1, le type

source: [1][2] - Point n type
fr: [n][2] - Point n, le type

source: Each point type is one of the following values:
fr: Chaque type de point est l'une des valeurs suivantes:

source: 0x00 - The point is the start of a figure
fr: 0x00 - Le point est le début d'une figure

source: 0x01 - The point is one of the two endpoints of a line
fr: 0x01 - Le point est l'une des deux extrémités d'une ligne

source: 0x03 - The point is an endpoint or control point of a cubic bezier spline
fr: 0x03 - Le point est un point de terminaison ou de contrôle d'une spline de Bézier cubique

source: 0x20 - The point is a marker
fr: 0x20 - Le point est un marqueur

source: 0x80 - The point is the last point in a closed subpath (figure)
fr: 0x80 - Le point est le dernier point d'un sous-chemin fermé (figure)

source: Fill mode of the interior of the path figures:
fr: Mode de remplissage de l'intérieur des tracés de figures :

source: a pointer to a new GraphicsPath object.
fr: un handle vers un nouvel objet GraphicsPath.

source: 0 and sets the @error flag to non-zero, @extended may contain GPSTATUS ($GPID_ERR*).
fr: 0 et définit @error <> 0, @extended peut contenir GPSTATUS ($GPID_ERR * ).

source: Search GdipCreatePath2 in MSDN Library
fr: Consultez GdipCreatePath2 dans la Librairie MSDN.

source: Releases a GraphicsPath object
fr: Libère un objet GraphicsPath

source: Search GdipDeletePath in MSDN Library
fr: Consultez GdipDeletePath dans la Librairie MSDN.

source: Applies a transformation to a path and converts each curve in the path to a sequence of connected lines
fr: Applique une transformation à un GraphicsPath et convertit chaque courbe en une séquence de segments de ligne connectés

source: Real number that specifies the maximum error between the path and its flattened approximation.
fr: Nombre décimal qui spécifie l'erreur maximale entre la trajectoire et son approximation aplatie.

source: Reducing the flatness increases the number of line segments in the approximation
fr: La réduction de la planéité augmente le nombre de segments de droite.

source: Pointer to a Matrix object that specifies the transformation to be applied to the path's data points
fr: Handle de l'objet Matrix qui spécifie la transformation à appliquer aux points de données de la trajectoire

source: Search GdipFlattenPath in MSDN Library
fr: Consultez GdipFlattenPath dans la Librairie MSDN.

source: Gets an array of points and types from a path
fr: Obtient un tableau de points et de types à partir d'un objet GraphicsPath

source: an array of points and types that specifies the endpoints and control points of the lines and bezier splines that are used to draw the path and the points types:
fr: Retourne un tableau de points et de types qui spécifie les points de terminaison et les points de contrôle des lignes et des splines de Bézier qui sont utilisés pour dessiner le tracé et les types points :

source: Search GdipGetPathData in MSDN Library
fr: Consultez GdipGetPathData dans la Librairie MSDN.

source: Gets the fill mode of a path
fr: Obtient le mode de remplissage d'un objet GraphicsPath

source: the fill mode of the interior of the path figures:
fr: Retourne le mode de remplissage de l'intérieur des tracés de figures :

source: Search GdipGetPathFillMode in MSDN Library
fr: Consultez GdipGetPathFillMode dans la Librairie MSDN.

source: Gets the ending point of the last figure in a path
fr: Obtient le point de terminaison de la dernière figure d'un objet GraphicsPath

source: [0] - X coordinate of the point
fr: [0] - Coordonnée X du point

source: [1] - Y coordinate of the point
fr: [1] - Coordonnée Y du point

source: Search GdipGetPathLastPoint in MSDN Library
fr: Consultez GdipGetPathLastPoint dans la Librairie MSDN.

source: Gets the number of points in a path's array of data points
fr: Obtient le nombre de points dans le tableau de données des points d'un objet GraphicsPath

source: the number of points contained in the path.
fr: Retourne le nombre de points contenus dans le GraphicsPath.

source: Search GdipGetPointCount in MSDN Library
fr: Consultez GdipGetPointCount dans la Librairie MSDN.

source: Gets an array of points from a path
fr: Obtient un tableau de points à partir d'un objet GraphicsPath

source: an array of points that define the path data points
fr: Retourne un tableau de points qui définit les points de données du GraphicsPath

source: Search GdipGetPathPoints in MSDN Library
fr: Consultez GdipGetPathPoints dans la Librairie MSDN.

source: Gets the bounding rectangle for a path
fr: Obtient le rectangle qui délimite un objet GraphicsPath

source: Pointer to a Matrix object that specifies a transformation to be applied to this path before the bounding rectangle is calculated.
fr: Handle de l'objet Matrix qui spécifie une transformation à appliquer à ce GraphicsPath avant que le rectangle de délimitation soit calculé.

source: The path is not permanently transformed
fr: Le chemin ne se transforme pas en permanence

source: Pointer to a Pen object that influences the size of the bounding rectangle.
fr: Handle de l'objet Pen qui influe sur la taille du rectangle de délimitation.
